app/controllers/admin/categories_controller.rb

  def index
    @categories = Category.all
---
SELECT * FROM "categories"

  def show
    @category = Category.find(params[:id])
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)